Autodesk.Revit.DB.Mechanical.MechanicalSystem.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.String)
Creates a new instance of a mechanical system and adds it to the document.
ADocument:
The document where the element will be created and added.
typeId:
The identifier of this mechanical system element's type.
name:
The name of the mechanical system to be created.
Returns:
The newly created mechanical system element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The typeId is not an element id for a valid mechanical system type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2011

Autodesk.Revit.DB.Mechanical.MechanicalSystem.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Creates a new instance of a mechanical system and adds it to the document.
ADocument:
The document where the element will be created and added.
typeId:
The identifier of this mechanical system element's type.
Returns:
The newly created mechanical system element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The typeId is not an element id for a valid mechanical system type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2011